//#include <iostream>
//
//using namespace std;
//
//bool IsPrime(int number)
//{
//	bool flag = true;
//	for (int i = 2; i < number; i++)
//	{
//		if (number % i == 0)
//		{
//			flag = false;
//			break;
//		}
//	}
//	return flag;
//}
//
//int main()
//{
//	int a;
//	cin >> a;
//	bool b;
//	b = IsPrime(a);
//	string output = b ? "true" : "false";
//	cout << output;
//	
//	//cout << IsPrime(a);
//}
//
//// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
//// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"
//
//// Советы по началу работы 
////   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
////   2. В окне Team Explorer можно подключиться к системе управления версиями.
////   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
////   4. В окне "Список ошибок" можно просматривать ошибки.
////   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
////   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
